In [3]:
# pandas module 설치
!pip install pandas

Requirement already satisfied: pandas in c:\developer\python39\lib\site-packages (1.3.1)

WARNING: You are using pip version 21.1.3; however, version 21.2.1 is available.

Requirement already satisfied: pytz>=2017.3 in c:\developer\python39\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: numpy>=1.17.3 in c:\developer\python39\lib\site-packages (from pandas) (1.21.0)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\developer\python39\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\developer\python39\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

You should consider upgrading via the 'c:\developer\python39\python.exe -m pip install --upgrade pip' command.

In [15]:
### 실습
import pandas as pd
s = pd.Series([1,9,-3,4])
#print(s)

#print(s.values) #값 확인
#print(s.index) # 인덱스 확인
#print(s.dtypes) # 자료형 확인

In [17]:
# 인덱스 지정
import pandas as pd
s = pd.Series ([1,9,-3,4]), index=(['a','b','c','d'])
print(s)

SyntaxError: cannot assign to function call (Temp/ipykernel_4892/2874737645.py, line 3)

In [18]:
# 사전과 호환
dic = {'A': 3000, 'B': 6000, 'C':2000, 'D':4000}
s= pd.Series(dic)
print(s)

A    3000
B    6000
C    2000
D    4000
dtype: int64

In [21]:
df = pd.DataFrame({'A':1.,
                  'B':'2021-05-06',
                  'C':[1,2,3,4],
                  'D':(5,6,7,8),
                  'E': 0,
                  'F':'Web'
                  })
print(df)

     A           B  C  D  E    F
0  1.0  2021-05-06  1  5  0  Web
1  1.0  2021-05-06  2  6  0  Web
2  1.0  2021-05-06  3  7  0  Web
3  1.0  2021-05-06  4  8  0  Web

In [23]:
# 인덱스 확인
# 행
print(df.index)
#열
print(df.columns)

RangeIndex(start=0, stop=4, step=1)
Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [25]:
data = {'name':['A','B','C','D','E'],
        'year' :[2017, 2018, 2019, 2020,2021],
        'points':[3.5,4.2,2.6,7.4,1.9]}
df = pd.DataFrame(data)
print(df)

  name  year  points
0    A  2017     3.5
1    B  2018     4.2
2    C  2019     2.6
3    D  2020     7.4
4    E  2021     1.9

In [26]:
print(df[['year']])

   year
0  2017
1  2018
2  2019
3  2020
4  2021

In [27]:
print(df[['year','points']])

   year  points
0  2017     3.5
1  2018     4.2
2  2019     2.6
3  2020     7.4
4  2021     1.9

In [28]:
# 새로운 열 추가
df['new'] = [1,2,3,4,5]
print(df)

  name  year  points  new
0    A  2017     3.5    1
1    B  2018     4.2    2
2    C  2019     2.6    3
3    D  2020     7.4    4
4    E  2021     1.9    5

In [29]:
# 조건을 사용하여 새로운 열 추가
df['past'] = df['year'] < 2020
print(df)

  name  year  points  new   past
0    A  2017     3.5    1   True
1    B  2018     4.2    2   True
2    C  2019     2.6    3   True
3    D  2020     7.4    4  False
4    E  2021     1.9    5  False

In [30]:
# 삭제
del df['past']
print(df)

  name  year  points  new
0    A  2017     3.5    1
1    B  2018     4.2    2
2    C  2019     2.6    3
3    D  2020     7.4    4
4    E  2021     1.9    5

In [38]:
# 인덱싱 행을 기준으로 데이터 추가 및 삭제
data = {'name':['A', 'B','C','D','E'],
       'year':[2017, 2018, 2019, 2020, 2021],
       'points':[3.5,4.2,2.6,7.4,1.9]}
df = pd.DataFrame(data)
print(df)

  name  year  points
0    A  2017     3.5
1    B  2018     4.2
2    C  2019     2.6
3    D  2020     7.4
4    E  2021     1.9

In [39]:
# 새로운 행 추가
df.loc[5,:] = ['F',2022,4.0]
print(df)

  name    year  points
0    A  2017.0     3.5
1    B  2018.0     4.2
2    C  2019.0     2.6
3    D  2020.0     7.4
4    E  2021.0     1.9
5    F  2022.0     4.0

In [40]:
# 범위선택
print(df[2:4])

  name    year  points
2    C  2019.0     2.6
3    D  2020.0     7.4

In [42]:
#DataFrame 데이터 분석 : 데이터 분석과 관련 다양한, 함수 제공
#sum : 행또는 열의합
#min,max
#mean
#median
#std, var : 표준편차, 분산
#count
# srot_values : 정렬
# corr,cov : 상관계수, 공분산
data = {'name':['A', 'B','C','D','E'],
       'year':[2017, 2018, 2019, 2020, 2021],
       'points':[3.5,4.2,2.6,7.4,1.9]}
df = pd.DataFrame(data)

# 각 행의 합
#print(df.sum(axis=1))
# 각 열의합
print(df.sum(axis=0))

name      ABCDE
year      10095
points     19.6
dtype: object

In [44]:
# pandas에서 data
df = pd.read_csv("cities.csv")

print(df)
# 파일을 저장하는 것도 비슷한 방법으로 한다.
df.to_csv("cities_new.csv")

       행정구역   총인구수(명)   남자인구수(명)   여자인구수(명)
0     서울특별시  51672400    4649442    4916548
1     부산광역시   9565990    1647291    1717067
2     대구광역시   2397646    1182380    1215266
3     인천광역시   2936367    1470544    1465823
4     광주광역시   1442647     713793     728854
5     대전광역시   1456107     726666     729441
6     울산광역시   1126369     578924     547445
7   세종특별자치시    362995     181328     181667
8       경기도  13500688    6795088    6705600
9       강원도   1535530     772949     762581
10     충청북도   1597503     810225     787278
11     충청남도   2117400    1082113    1035287
12     전라북도   1794345     892670     901675
13     전라남도   1840921     926398     914523
14     경상북도   2632401    1326844    1305557
15     경상남도   3325840    1674612    1651228
16  제주특별자치도    675293     338766     336527

In [47]:
df.head(7)

    행정구역   총인구수(명)   남자인구수(명)   여자인구수(명)
0  서울특별시  51672400    4649442    4916548
1  부산광역시   9565990    1647291    1717067
2  대구광역시   2397646    1182380    1215266
3  인천광역시   2936367    1470544    1465823
4  광주광역시   1442647     713793     728854
5  대전광역시   1456107     726666     729441
6  울산광역시   1126369     578924     547445

In [49]:
df.tail()

       행정구역   총인구수(명)   남자인구수(명)   여자인구수(명)
12     전라북도   1794345     892670     901675
13     전라남도   1840921     926398     914523
14     경상북도   2632401    1326844    1305557
15     경상남도   3325840    1674612    1651228
16  제주특별자치도    675293     338766     336527

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   행정구역       17 non-null     object
 1    총인구수(명)   17 non-null     int64
 2    남자인구수(명)  17 non-null     int64
 3    여자인구수(명)  17 non-null     int64
dtypes: int64(3), object(1)
memory usage: 672.0+ bytes

In [52]:
# df.shape 는 행과 열의 수를 빠르게 확인할수 있다
df.shape

(17, 4)

In [53]:
df.describe()

            총인구수(명)      남자인구수(명)      여자인구수(명)
count  1.700000e+01  1.700000e+01  1.700000e+01
mean   5.881202e+06  1.515884e+06  1.523669e+06
std    1.227352e+07  1.680130e+06  1.697563e+06
min    3.629950e+05  1.813280e+05  1.816670e+05
25%    1.456107e+06  7.266660e+05  7.294410e+05
50%    1.840921e+06  9.263980e+05  9.145230e+05
75%    2.936367e+06  1.470544e+06  1.465823e+06
max    5.167240e+07  6.795088e+06  6.705600e+06

In [54]:
# 각 데이터 항목별로도 확인할 수 있다.
df.count()
#df.mean()
#df.max()
#df.min()
#df.median()
#df.std()

행정구역         17
 총인구수(명)     17
 남자인구수(명)    17
 여자인구수(명)    17
dtype: int64

In [55]:
#1. 타이타닉 데이터를 df형태로 읽어오세요.
#2. df 출력해보고
#3. head(), tail(), info(), shape, describe

In [62]:
df = pd.read_csv("titanic.csv")
print(df)

    \tSurvived\tPclass\tSex\tAge\tFare\tEmbarked\tClass\tAdult_Male\tEmbarktown\t
0    0\t0\t3\tmale\t22\t7.25\tS\tThird\tTRUE\tSouth...
1    1\t1\t1\tfemale\t38\t71.2833\tC\tFirst\tFALSE\...
2    2\t1\t3\tfemale\t26\t7.925\tS\tThird\tFALSE\tS...
3    3\t1\t1\tfemale\t35\t53.1\tS\tFirst\tFALSE\tSo...
4    4\t0\t3\tmale\t35\t8.05\tS\tThird\tTRUE\tSouth...
..                                                 ...
886  886\t0\t2\tmale\t27\t13\tS\tSecond\tTRUE\tSout...
887  887\t1\t1\tfemale\t19\t30\tS\tFirst\tFALSE\tSo...
888  888\t0\t3\tfemale\t29.69911765\t23.45\tS\tThir...
889  889\t1\t1\tmale\t26\t30\tC\tFirst\tTRUE\tCherb...
890  890\t0\t3\tmale\t32\t7.75\tQ\tThird\tTRUE\tQue...

[891 rows x 1 columns]

In [63]:
df.describe()

       \tSurvived\tPclass\tSex\tAge\tFare\tEmbarked\tClass\tAdult_Male\tEmbarktown\t
count                                                 891
unique                                                891
top     0\t0\t3\tmale\t22\t7.25\tS\tThird\tTRUE\tSouth...
freq                                                    1